Argon4W/SlimeVR-Tracker-Firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_DEBUG_LOGGING=y
CONFIG_I2C_MASTER_DEBUG_LOGGING=y
CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
